In [1]:
import pandas as pd
import sklearn as sk
import numpy as np
import seaborn as sns
import matplotlib
import matplotlib.pyplot as plt
from matplotlib import rcParams
%matplotlib inline

import os

In [2]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

student_data.head()

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2

Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.

In [3]:
school_group_df = student_data.groupby(['school_code'])
school_group_df

In [5]:
for name,group in school_group_df:
    print("\nGroup:")
    print(name)
    print(group)

Group:
s001
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

Group:
s002
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2

Group:
s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Group:
s004
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [7]:
print("\nType of the object:")
print(type(school_group_df))

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

In [9]:
grouped_single = student_data.groupby('school_code').agg({'age': ['mean', 'min', 'max']})
print(grouped_single)

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

Write a Pandas program to split the following given dataframe into groups based on school code and class.

In [10]:
print('\nSplit the said data on school_code, class wise:')
result = student_data.groupby(['school_code', 'class'])
for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)

Split the said data on school_code, class wise:

Group:
('s001', 'V')
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1

Group:
('s001', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1

Group:
('s002', 'V')
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2

Group:
('s003', 'VI')
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Group:
('s004', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

Write a Pandas program to split the following given dataframe into groups based on school code and cast grouping as a list.

In [11]:
print('\nCast grouping as a list:')
result = student_data.groupby(['school_code'])
print(list(result))

Cast grouping as a list:
[('s001',    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1  ), ('s002',    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2  ), ('s003',    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3), ('s004',    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4  )]

Write a Pandas program to split the following given dataframe into groups based on single column and multiple columns. Find the size of the grouped data.

In [12]:
print('\nSplit the said data on school_code wise:')
grouped_single = student_data.groupby(['school_code'])
print("Size of the grouped data - single column")
print(grouped_single.size())

Split the said data on school_code wise:
Size of the grouped data - single column
school_code
s001    2
s002    2
s003    1
s004    1
dtype: int64

In [13]:
print('\nSplit the data on mulitple columns')
multi_group = student_data.groupby(['school_code','class'])
print("Size of the grouped data - multi column")
print(multi_group.size())

Split the data on mulitple columns
Size of the grouped data - multi column
school_code  class
s001         V        1
             VI       1
s002         V        2
s003         VI       1
s004         VI       1
dtype: int64

Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group.

In [14]:
grouped = student_data.groupby(['school_code'])
print("Call school code 's001':")
print(grouped.get_group('s001'))
print("\nCall school code 's004':")
print(grouped.get_group('s004'))

Call school code 's001':
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

Call school code 's004':
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id)

In [15]:
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print("Original Orders DataFrame:")
print(orders_data)

Original Orders DataFrame:
    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [16]:
groupby_cust_id = orders_data.groupby(['customer_id']).agg({'purch_amt':['mean', 'min', 'max']})
print(groupby_cust_id)

               purch_amt
                    mean      min      max
customer_id
3001          270.650000   270.65   270.65
3002         2956.953333    65.26  5760.00
3003           75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005          549.500000   150.50   948.50
3007         2400.600000  2400.60  2400.60
3008          250.450000   250.45   250.45
3009         1295.450000   110.50  2480.40

Write a Pandas program to split a dataset to group by two columns and count by each row.

In [22]:
orders_data_cnt_rows = orders_data.groupby(['customer_id','salesman_id']).size().reset_index().groupby(['salesman_id','customer_id'])[[0]].max()
orders_data_cnt_rows

                         0
salesman_id customer_id
5001        3002         3
            3007         1
5002        3005         2
            3008         1
5003        3009         2
5005        3001         1
5006        3004         1
5007        3003         1

In [24]:
orders_data_cnt = orders_data.groupby(['customer_id','salesman_id']).size()
orders_data_cnt

customer_id  salesman_id
3001         5005           1
3002         5001           3
3003         5007           1
3004         5006           1
3005         5002           2
3007         5001           1
3008         5002           1
3009         5003           2
dtype: int64

In [25]:
orders_data_cnt = orders_data.groupby(['customer_id','salesman_id']).size().reset_index()
orders_data_cnt

   customer_id  salesman_id  0
0         3001         5005  1
1         3002         5001  3
2         3003         5007  1
3         3004         5006  1
4         3005         5002  2
5         3007         5001  1
6         3008         5002  1
7         3009         5003  2

Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups.
In the following dataset group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups.

In [35]:
orders_sort = orders_data.groupby(['customer_id','salesman_id']).agg({'purch_amt':'sum'})
orders_sort

                         purch_amt
customer_id salesman_id
3001        5005            270.65
3002        5001           8870.86
3003        5007             75.29
3004        5006           1983.43
3005        5002           1099.00
3007        5001           2400.60
3008        5002            250.45
3009        5003           2590.90

In [36]:
result = orders_sort['purch_amt'].groupby(level=0, group_keys=False)
result

In [37]:
print(result.nlargest())

customer_id  salesman_id
3001         5005            270.65
3002         5001           8870.86
3003         5007             75.29
3004         5006           1983.43
3005         5002           1099.00
3007         5001           2400.60
3008         5002            250.45
3009         5003           2590.90
Name: purch_amt, dtype: float64

Write a Pandas program to split the following dataframe into groups based on customer id and create a list of order date for each group.

In [39]:
order_take_df = orders_data.groupby('customer_id')['ord_date'].apply(list)
order_take_df

customer_id
3001                            [2012-09-10]
3002    [2012-10-05, 2012-09-10, 2012-04-25]
3003                            [2012-08-17]
3004                            [2012-10-10]
3005                [2012-10-05, 2012-09-10]
3007                            [2012-07-27]
3008                            [2012-06-27]
3009                [2012-08-17, 2012-10-10]
Name: ord_date, dtype: object

Write a Pandas program to split the following dataframe into groups and calculate monthly purchase amount.

In [40]:
orders_data.head(5)

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3005         5002
1   70009     270.65  2012-09-10         3001         5005
2   70002      65.26  2012-10-05         3002         5001
3   70004     110.50  2012-08-17         3009         5003
4   70007     948.50  2012-09-10         3005         5002

In [42]:
new_order_df = orders_data
new_order_df['ord_date']= pd.to_datetime(new_order_df['ord_date'])
new_order_df.head()

   ord_no  purch_amt   ord_date  customer_id  salesman_id
0   70001     150.50 2012-10-05         3005         5002
1   70009     270.65 2012-09-10         3001         5005
2   70002      65.26 2012-10-05         3002         5001
3   70004     110.50 2012-08-17         3009         5003
4   70007     948.50 2012-09-10         3005         5002

In [44]:
result = new_order_df.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
print(result)

            purch_amt
ord_date
2012-04-30    3045.60
2012-05-31       0.00
2012-06-30     250.45
2012-07-31    2400.60
2012-08-31     185.79
2012-09-30    6979.15
2012-10-31    4679.59

Write a Pandas program to split the following dataframe into groups, group by month and year based on order date and find the total purchase amount year wise, month wise

In [46]:
result = new_order_df.groupby([new_order_df['ord_date'].dt.year, new_order_df['ord_date'].dt.month]).agg({'purch_amt':sum})
print(result)

                   purch_amt
ord_date ord_date
2012     4           3045.60
         6            250.45
         7           2400.60
         8            185.79
         9           6979.15
         10          4679.59

Write a Pandas program to split the following dataframe into groups based on first column and set other column values into a list of values.

In [48]:
df = pd.DataFrame( {'X' : [10, 10, 10, 20, 30, 30, 10], 
                    'Y' : [10, 15, 11, 20, 21, 12, 14], 
                    'Z' : [22, 20, 18, 20, 13, 10, 0]})
print("Original DataFrame:")
print(df)

Original DataFrame:
    X   Y   Z
0  10  10  22
1  10  15  20
2  10  11  18
3  20  20  20
4  30  21  13
5  30  12  10
6  10  14   0

In [49]:
res = df.groupby('X').aggregate(lambda t:t.unique().tolist())
print(res)

                   Y                Z
X
10  [10, 15, 11, 14]  [22, 20, 18, 0]
20              [20]             [20]
30          [21, 12]         [13, 10]

Write a Pandas program to split the following dataframe into groups based on all columns and calculate Groupby value counts on the dataframe.

In [50]:
df = pd.DataFrame( {'id' : [1, 2, 1, 1, 2, 1, 2], 
                    'type' : [10, 15, 11, 20, 21, 12, 14], 
                    'book' : ['Math','English','Physics','Math','English','Physics','English']})

print("Original DataFrame:")
print(df)

Original DataFrame:
   id  type     book
0   1    10     Math
1   2    15  English
2   1    11  Physics
3   1    20     Math
4   2    21  English
5   1    12  Physics
6   2    14  English

In [51]:
result = df.groupby(['id', 'type', 'book']).size().unstack(fill_value=0)
print("\nResult:")
print(result)

Result:
book     English  Math  Physics
id type
1  10          0     1        0
   11          0     0        1
   12          0     0        1
   20          0     1        0
2  14          1     0        0
   15          1     0        0
   21          1     0        0

Write a Pandas program to split the following dataframe into groups and count unique values of 'value' column.

In [52]:
df = pd.DataFrame({
    'id': [1, 1, 2, 3, 3, 4, 4, 4],
    'value': ['a', 'a', 'b', None, 'a', 'a', None, 'b']
})
print("Original DataFrame:")
print(df)

Original DataFrame:
   id value
0   1     a
1   1     a
2   2     b
3   3  None
4   3     a
5   4     a
6   4  None
7   4     b

In [53]:
print("Count unique values:")
print (df.groupby('value')['id'].nunique())

Count unique values:
value
a    3
b    2
Name: id, dtype: int64

Write a Pandas program to split a given dataframe into groups and list all the keys from the GroupBy object.

In [54]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
print("Original DataFrame:")
print(df)

Original DataFrame:
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31
S6        s004    VI    David Parkes     15/09/1997   12     159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

In [55]:
print("\nSplit the data on school_code:");
gp = df.groupby('school_code')
print("\nList of all the keys:")
print(gp.groups.keys())

Split the data on school_code:

List of all the keys:
dict_keys(['s001', 's002', 's003', 's004'])

Write a Pandas program to split a given dataframe into groups and create a new column with count from GroupBy

In [57]:
df = pd.DataFrame({
'book_name':['Book1','Book2','Book3','Book4','Book1','Book2','Book3','Book5'],
'book_type':['Math','Physics','Computer','Science','Math','Physics','Computer','English'],
'book_id':[1,2,3,4,1,2,3,5]})
print("Original Orders DataFrame:")
print(df)

Original Orders DataFrame:
  book_name book_type  book_id
0     Book1      Math        1
1     Book2   Physics        2
2     Book3  Computer        3
3     Book4   Science        4
4     Book1      Math        1
5     Book2   Physics        2
6     Book3  Computer        3
7     Book5   English        5

In [63]:
res = df.groupby(["book_name", "book_type"])["book_type"].count().reset_index(name="count")
res

  book_name book_type  count
0     Book1      Math      2
1     Book2   Physics      2
2     Book3  Computer      2
3     Book4   Science      1
4     Book5   English      1

Write a Pandas program to split a given dataframe into groups with bin counts

In [64]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'sales_id':[5002,5003,5004,5003,5002,5001,5005,5007,5008,5004,5005,5001]})
print("Original DataFrame:")
print(df)

Original DataFrame:
    ord_no  purch_amt  customer_id  sales_id
0    70001     150.50         3005      5002
1    70009     270.65         3001      5003
2    70002      65.26         3002      5004
3    70004     110.50         3009      5003
4    70007     948.50         3005      5002
5    70005    2400.60         3007      5001
6    70008    5760.00         3002      5005
7    70010    1983.43         3004      5007
8    70003    2480.40         3009      5008
9    70012     250.45         3008      5004
10   70011      75.29         3003      5005
11   70013    3045.60         3002      5001

In [65]:
groups = df.groupby(['customer_id', pd.cut(df.sales_id, 3)])
result = groups.size().unstack()
print(result)

sales_id     (5000.993, 5003.333]  (5003.333, 5005.667]  (5005.667, 5008.0]
customer_id
3001                            1                     0                   0
3002                            1                     2                   0
3003                            0                     1                   0
3004                            0                     0                   1
3005                            2                     0                   0
3007                            1                     0                   0
3008                            0                     1                   0
3009                            1                     0                   1

Write a Pandas program to split a given dataframe into groups with multiple aggregations. Go to the editor
Split the following given dataframe by school code, class and get mean, min, and max value of height and age for each value of the school.

In [66]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s001'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
print("Original DataFrame:")
print(df)

Original DataFrame:
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31
S6        s001    VI    David Parkes     15/09/1997   12     159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

In [70]:
res = df.groupby(['school_code','class']).agg({'age':['mean','min','max'],'height':['mean','min','max']})
res

                    age         height
                   mean min max   mean  min  max
school_code class
s001        V      12.0  12  12  173.0  173  173
            VI     12.5  12  13  163.0  159  167
s002        V      13.0  12  14  171.5  151  192
s003        VI     13.0  13  13  186.0  186  186

Write a Pandas program to split a given dataframe into groups and display target column as a list of unique values.

In [71]:
df = pd.DataFrame( {'id' : ['A','A','A','A','A','A','B','B','B','B','B'], 
                    'type' : [1,1,1,1,2,2,1,1,1,2,2], 
                    'book' : ['Math','Math','English','Physics','Math','English','Physics','English','Physics','English','English']})

print("Original DataFrame:")
print(df)

Original DataFrame:
   id  type     book
0   A     1     Math
1   A     1     Math
2   A     1  English
3   A     1  Physics
4   A     2     Math
5   A     2  English
6   B     1  Physics
7   B     1  English
8   B     1  Physics
9   B     2  English
10  B     2  English

In [81]:
new_df = df[['id', 'type', 'book']].drop_duplicates().groupby(['id','type'])['book'].apply(list).reset_index()
new_df

  id  type                      book
0  A     1  [Math, English, Physics]
1  A     2           [Math, English]
2  B     1        [Physics, English]
3  B     2                 [English]

Write a Pandas program to split the following dataframe into groups and calculate quarterly purchase amount.

In [82]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print("Original Orders DataFrame:")
print(df)

Original Orders DataFrame:
    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  05-10-2012         3001         5002
1    70009     270.65  09-10-2012         3001         5005
2    70002      65.26  05-10-2012         3005         5001
3    70004     110.50  08-17-2012         3001         5003
4    70007     948.50  10-09-2012         3005         5002
5    70005    2400.60  07-27-2012         3001         5001
6    70008    5760.00  10-09-2012         3005         5001
7    70010    1983.43  10-10-2012         3001         5006
8    70003    2480.40  10-10-2012         3005         5003
9    70012     250.45  06-17-2012         3001         5002
10   70011      75.29  07-08-2012         3005         5007
11   70013    3045.60  04-25-2012         3005         5001

In [85]:
res_amount = df.groupby('ord_date').agg({'purch_amt':'sum'}).reset_index()
res_amount

     ord_date  purch_amt
0  04-25-2012    3045.60
1  05-10-2012     215.76
2  06-17-2012     250.45
3  07-08-2012      75.29
4  07-27-2012    2400.60
5  08-17-2012     110.50
6  09-10-2012     270.65
7  10-09-2012    6708.50
8  10-10-2012    4463.83

In [88]:
res_amount['ord_date'] = pd.to_datetime(res_amount['ord_date'])

In [89]:
res_amount['month'] = res_amount['ord_date'].dt.month
res_amount

    ord_date  purch_amt  month
0 2012-04-25    3045.60      4
1 2012-05-10     215.76      5
2 2012-06-17     250.45      6
3 2012-07-08      75.29      7
4 2012-07-27    2400.60      7
5 2012-08-17     110.50      8
6 2012-09-10     270.65      9
7 2012-10-09    6708.50     10
8 2012-10-10    4463.83     10

In [90]:
df['ord_date'] = pd.to_datetime(df['ord_date'])

In [94]:
# res_quarterly = df.set_index('ord_date').grouby(pd.Grouper(freq='Q')).agg({'purch_amt':'sum'})
# res_quarterly

result = df.set_index('ord_date').groupby(pd.Grouper(freq='Q')).agg({'purch_amt':sum})
print(result)

            purch_amt
ord_date
2012-06-30    3511.81
2012-09-30    2857.04
2012-12-31   11172.33

Write a Pandas program to split the following dataframe into groups by school code and get mean, min, and max value of age with customized column name for each school.

In [95]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    ' height ': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print("Original DataFrame:")
print(student_data)

Original DataFrame:
   school_code class            name date_Of_Birth   age   height   weight  \
S1        s001     V  Alberto Franco     15/05/2002   12       173      35
S2        s002     V    Gino Mcneill     17/05/2002   12       192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13       186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13       167      30
S5        s002     V    Gino Mcneill     11/05/2002   14       151      31
S6        s004    VI    David Parkes     15/09/1997   12       159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

In [98]:
student_data_res = student_data.groupby('school_code').agg(Age_mean=('age','mean'), Age_min=('age','min'), Age_max=('age','max'))
student_data_res

             Age_mean  Age_min  Age_max
school_code
s001             12.5       12       13
s002             13.0       12       14
s003             13.0       13       13
s004             12.0       12       12

Write a Pandas program to split the following datasets into groups on customer id and calculate the number of customers starting with 'C', the list of all products and the difference of maximum purchase amount and minimum purchase amount.

In [99]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
'customer_id':['C3001','C3001','D3005','D3001','C3005','D3001','C3005','D3001','D3005','C3001','D3005','D3005'],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print("Original Orders DataFrame:")
print(df)

Original Orders DataFrame:
    ord_no  purch_amt    ord_date customer_id  salesman_id
0    70001     150.50  05-10-2012       C3001         5002
1    70009     270.65  09-10-2012       C3001         5005
2    70002      65.26  05-10-2012       D3005         5001
3    70004     110.50  08-17-2012       D3001         5003
4    70007     948.50  10-09-2012       C3005         5002
5    70005    2400.60  07-27-2012       D3001         5001
6    70008    5760.00  10-09-2012       C3005         5001
7    70010    1983.43  10-10-2012       D3001         5006
8    70003    2480.40  10-10-2012       D3005         5003
9    70012     250.45  06-17-2012       C3001         5002
10   70011      75.29  07-08-2012       D3005         5007
11   70013    3045.60  04-25-2012       D3005         5001

In [104]:
def customer_id_C(x):
    return (x.str[0]=='C').sum()

In [105]:
result = df.groupby('salesman_id').agg(Customer_id_C = ('customer_id',customer_id_C),
                                       customer_id_list=('customer_id', lambda x: ', '.join(x)),
                                       purchase_amt_gap   = ('purch_amt', lambda x: x.max()-x.min())
                                      )
result

             Customer_id_C            customer_id_list  purchase_amt_gap
salesman_id
5001                     1  D3005, D3001, C3005, D3005           5694.74
5002                     3         C3001, C3005, C3001            798.00
5003                     0                D3001, D3005           2369.90
5005                     1                       C3001              0.00
5006                     0                       D3001              0.00
5007                     0                       D3005              0.00

Write a Pandas program to split the following datasets into groups on customer_id to summarize purch_amt and calculate percentage of purch_amt in each group

In [118]:
gr_data = df.groupby('customer_id').agg({'purch_amt':'sum'})
gr_data

             purch_amt
customer_id
C3001           671.60
C3005          6708.50
D3001          4494.53
D3005          5666.55

In [120]:
gr_data["% (Purch Amt.)"] = gr_data.apply(lambda x:  100*x / x.sum())
gr_data

             purch_amt  % (Purch Amt.)
customer_id
C3001           671.60        3.828705
C3005          6708.50       38.244291
D3001          4494.53       25.622735
D3005          5666.55       32.304269

In [121]:
gr_data = gr_data.reset_index()
gr_data

  customer_id  purch_amt  % (Purch Amt.)
0       C3001     671.60        3.828705
1       C3005    6708.50       38.244291
2       D3001    4494.53       25.622735
3       D3005    5666.55       32.304269

Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group, also change the column name of the aggregated metric. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).

In [122]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
print("Original DataFrame:")
print(df)

Original DataFrame:
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31
S6        s004    VI    David Parkes     15/09/1997   12     159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

In [124]:
agg_data = df.groupby('school_code').agg(Mean_age=('age','mean'), Min_age=('age','min'), Max_age=('age','max'))
agg_data

             Mean_age  Min_age  Max_age
school_code
s001             12.5       12       13
s002             13.0       12       14
s003             13.0       13       13
s004             12.0       12       12

Write a Pandas program to split a given dataset, group by two columns and convert other columns of the dataframe into a dictionary with column header as key

In [125]:
dict_data_list = list()

for gg, dd in df.groupby(['school_code','class']):
    group = dict(zip(['school_code','class'], gg))
    ocolumns_list = list()
    for _, data in dd.iterrows():
        data = data.drop(labels=['school_code','class'])
        ocolumns_list.append(data.to_dict())
    group['other_columns'] = ocolumns_list
    dict_data_list.append(group)

print(dict_data_list)

[{'school_code': 's001', 'class': 'V', 'other_columns': [{'name': 'Alberto Franco', 'date_Of_Birth ': '15/05/2002', 'age': 12, 'height': 173, 'weight': 35, 'address': 'street1'}]}, {'school_code': 's001', 'class': 'VI', 'other_columns': [{'name': 'Eesha Hinton', 'date_Of_Birth ': '25/09/1998', 'age': 13, 'height': 167, 'weight': 30, 'address': 'street1'}]}, {'school_code': 's002', 'class': 'V', 'other_columns': [{'name': 'Gino Mcneill', 'date_Of_Birth ': '17/05/2002', 'age': 12, 'height': 192, 'weight': 32, 'address': 'street2'}, {'name': 'Gino Mcneill', 'date_Of_Birth ': '11/05/2002', 'age': 14, 'height': 151, 'weight': 31, 'address': 'street2'}]}, {'school_code': 's003', 'class': 'VI', 'other_columns': [{'name': 'Ryan Parkes', 'date_Of_Birth ': '16/02/1999', 'age': 13, 'height': 186, 'weight': 33, 'address': 'street3'}]}, {'school_code': 's004', 'class': 'VI', 'other_columns': [{'name': 'David Parkes', 'date_Of_Birth ': '15/09/1997', 'age': 12, 'height': 159, 'weight': 32, 'address': 'street4'}]}]

Write a Pandas program to split a given dataset, group by one column and apply an aggregate function to few columns and another aggregate function to the rest of the columns of the dataframe.

In [126]:
df = pd.DataFrame({
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001],
'sale_jan':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 1760, 2983.43, 480.4,  1250.45, 75.29,1045.6],
'sale_feb':[250.5, 170.65, 15.26, 110.5, 598.5, 1400.6, 2760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_mar':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_apr':[150.5, 270.65, 95.26, 210.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_may':[130.5, 270.65, 65.26, 310.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_jun':[150.5, 270.65, 45.26, 110.5, 948.5, 3400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_jul':[950.5, 270.65, 65.26, 210.5, 948.5, 2400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_aug':[150.5, 70.65,  65.26, 110.5, 948.5, 400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_sep':[150.5, 270.65, 65.26, 110.5, 948.5, 200.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_oct':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_nov':[150.5, 270.65, 95.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6], 
'sale_dec':[150.5, 70.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6]
})
print("Original Orders DataFrame:")
print(df)

Original Orders DataFrame:
    salesman_id  sale_jan  sale_feb  sale_mar  sale_apr  sale_may  sale_jun  \
0          5002    150.50    250.50    150.50    150.50    130.50    150.50
1          5005    270.65    170.65    270.65    270.65    270.65    270.65
2          5001     65.26     15.26     65.26     95.26     65.26     45.26
3          5003    110.50    110.50    110.50    210.50    310.50    110.50
4          5002    948.50    598.50    948.50    948.50    948.50    948.50
5          5001   2400.60   1400.60   2400.60   2400.60   2400.60   3400.60
6          5001   1760.00   2760.00   5760.00    760.00    760.00   5760.00
7          5006   2983.43   1983.43   1983.43   1983.43   1983.43    983.43
8          5003    480.40   2480.40   2480.40   2480.40   2480.40   2480.40
9          5002   1250.45    250.45    250.45    250.45    250.45    250.45
10         5007     75.29     75.29     75.29     75.29     75.29     75.29
11         5001   1045.60   3045.60   3045.60   3045.60   3045.60   3045.60

    sale_jul  sale_aug  sale_sep  sale_oct  sale_nov  sale_dec
0     950.50    150.50    150.50    150.50    150.50    150.50
1     270.65     70.65    270.65    270.65    270.65     70.65
2      65.26     65.26     65.26     65.26     95.26     65.26
3     210.50    110.50    110.50    110.50    110.50    110.50
4     948.50    948.50    948.50    948.50    948.50    948.50
5    2400.60    400.60    200.60   2400.60   2400.60   2400.60
6    5760.00   5760.00   5760.00   5760.00   5760.00   5760.00
7     983.43   1983.43   1983.43   1983.43   1983.43   1983.43
8    2480.40   2480.40   2480.40   2480.40   2480.40   2480.40
9     250.45    250.45    250.45    250.45    250.45    250.45
10     75.29     75.29     75.29     75.29     75.29     75.29
11   3045.60   3045.60   3045.60   3045.60   3045.60   3045.60

In [128]:
df_agg = df.groupby('salesman_id').agg(lambda x:x.sum() if x.name in ['sale_jan','sale_feb','sale_mar'] else x.mean())
df_agg

,sale_jan,sale_feb,sale_mar,sale_apr,sale_may,sale_jun,sale_jul,sale_aug,sale_sep,sale_oct,sale_nov,sale_dec
salesman_id,,,,,,,,,,,,
5001,5271.46,7221.46,11271.46,1575.365000,1567.865,3062.865000,2817.865000,2317.865000,2267.865000,2817.865000,2825.365000,2817.865000
5002,2349.45,1099.45,1349.45,449.816667,443.150,449.816667,716.483333,449.816667,449.816667,449.816667,449.816667,449.816667
5003,590.90,2590.90,2590.90,1345.450000,1395.450,1295.450000,1345.450000,1295.450000,1295.450000,1295.450000,1295.450000,1295.450000
5005,270.65,170.65,270.65,270.650000,270.650,270.650000,270.650000,70.650000,270.650000,270.650000,270.650000,70.650000
5006,2983.43,1983.43,1983.43,1983.430000,1983.430,983.430000,983.430000,1983.430000,1983.430000,1983.430000,1983.430000,1983.430000
5007,75.29,75.29,75.29,75.290000,75.290,75.290000,75.290000,75.290000,75.290000,75.290000,75.290000,75.290000

Write a Pandas program to split a given dataset, group by one column and remove those groups if all the values of a specific columns are not available.